title.question.m_reverse_engineering = ¿En qu&eacute; consiste la ingenier&iacute;a inversa m&oacute;vil?

paragraph.info.1 = Uno de los mayores peligros de las aplicaciones m&oacute;viles es la ingenier&iacute;a inversa. Se puede realizar facilmente y puede revelar c&oacute;digo fuente, claves de APIs, claves de encriptaci&oacute;n, funcionalidad oculta de Admin, o passwords hard coded. Los desarrolladores pueden enrevesar, ofuscar su c&oacute;digo para que sea m&aacute;s dificil de leer por un atacante... y en muchos casos la ofuscaci&oacute;n es la &uacute;nica defensa. 
paragraph.info.2 = <a>ProGuard</a> es una herramienta que ahora se viene incluida con Android SDK y se puede utilizar para optimizar, encoger y <a>ofuscar</a> c&oacute;digo. La ofuscaci&oacute;n hace que si alguien realiza ingenier&iacute;a inversa de la aplicaci&oacute;n, el c&oacute;digo ser&aacute; m&aacute;s dif&iacute;cil de leer. Aunque ProGuard es una herramienta excelente, no proteger&aacute; tu c&oacute;digo. ProGuard se puede utilizar ya que proporciona otros beneficios, pero lo &uacute;nico que conseguir&aacute; de cara a un atacante, es hacer el proceso m&aacute;s lento y no impide que los atacantes accedan a informaci&oacute;n sensible.
paragraph.info.3 = Otras t&eacute;cnicas de ofuscaci&oacute;n incluyen no s&oacute;lo la opci&oacute;n de hacer el c&oacute;digo m&aacute;s dif&iacute;cil de leer, sino tambi&eacute;n m&aacute;s confuso. En lugar de utilizar comparaciones de strings hard coded, la App puede utilizar una funci&oacute;n para comprobar la validez de un password.

challenge.description = Hay dos herramientas que necesitar&aacute;s para realizar ingenier&iacute;a inversa de una App. <a>Dex2Jar</a> y <a>JD-GUI</a>. Una vez que tengas estas herramientas y la APK que quieres atacar, utiliza dex2jar para convertir la APK en un archivo jar. Luego, abre el .jar con JD-GUI. Lleva a cabo este proceso contra la app de esta lecci&oacute;n e investiga el c&oacute;digo fuente para obtener la clave resultado.

button.hideIntro = Ocultar intoducci&oacute;n
button.showIntro = Mostrar intoducci&oacute;n