title.question.m_insecure_data_storeage =  ¿En qu&eacute; consiste el almacenamiento de datos inseguro en móviles (Mobile Insecure Data Storage)?

paragraph.info.1 = El almacenamiento de datos inseguro ocurre cuando una aplicaci&oacute;n almacena datos o informaci&oacute;n sensible (credenciales de usuario, claves de API, Informaci&oacute;n de tarjetas de pago etc.) de forma insegura. Esto puede producirse de varias formas. Generalmente, para almacenar informaci&oacute;n en el lado del cliente (Client-side) las aplicaciones utilizan una base de datos <a>Sqlite</a>.
paragraph.info.2 = Esto se produce en parte, por el hecho de que este m&eacute;todo de almacenamiento resulta m&aacute;s barato - Un servicio de almacenamiento back-end ser&iacute;a m&aacute;s costoso. Como resultado, cualquier usuario puede acceder a la informaci&oacute;n almacenada por la aplicaci&oacute;m. El almacenamiento de datos inseguro se convierte en un peligro cuando la aplicaci&oacute;n  guarda informaci&oacute;n sensible del usuario en cache, le roban el m&oacute;vil o el atacante roba la informaci&oacute;n accediendo a la base de datos local. El malware tambi&eacute;n puede acceder a esta informaci&oacute;n facilmente. Este riesgo aumenta con la popularidad de dispositives rooteados o <a>rooting devices</a> que facilita mucho la tarea a un atacante a la hora de acceder a esta informaci&oacute;n.
paragraph.info.3 = Hay otros modos de almacenar datos de forma insegura. El uso de algoritmos de hashing conocidos pueden impactar a los usuarios de aplicaciones m&oacute;viles.No solo son susceptibles de <a>colisiones</a>, cuando dos passwords diferentes podr&iacute;an generar el mismo hash y ser interpretados como el mismo password, el desarrollador tendr&iacute;a que asumir que sus usuarios eligen passwords seguros. Esto generalmente no es el caso y una vez que el valor de hash se ha crackeado, el ataque simplemente necesita actualizar sus tablas.
paragraph.info.4 = Este m&eacute;todo auno no utiliza clave. Por tanto, se puede asumir que realmente no es encriptaci&oacute;n. Los algoritmos de hash son &uacute;tiles para comparar dos archivos diferentes pero no se deben utilizar para almacenar passwords (a menos que se usen correctamente).

button.hideIntro = Ocultar intoducci&oacute;n
button.showIntro = Mostrar intoducci&oacute;n

challenge.description = Normalmente, una app Android almacenar&aacute; su base de datos en el directorio <a>/data/data/com.app.exampleApp/database/</a>. Cualquiera que tenga un dispositivo rooteado puede acceder a este directorio. La app Android de esta lecci&oacute;n almacena sus datos bajo credenciales en una base de datos <a>SQLite database</a>. El password del Admin es la clave resultado de esta lecci&oacute;n.